# GetIssuesForFaceSet Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilderResult..::..GetIssuesForFaceSet Method
TessellatedShapeBuilderResult Class See Also
---
Returns the array of issues encountered while processing a face set with index 'setIndex'.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IList<TessellatedBuildIssue> GetIssuesForFaceSet(
	int setIndex
)
```

Visual Basic
---
```text
Public Function GetIssuesForFaceSet ( _
	setIndex As Integer _
) As IList(Of TessellatedBuildIssue)
```

Visual C++
---
```text
public:
IList<TessellatedBuildIssue^>^ GetIssuesForFaceSet(
	int setIndex
)
```

# ### Parameters
setIndex
    Type: System..::..Int32 Index of the face set.
# ### Return Value
Array of issues encountered while processing a face set with index 'setIndex'.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | 'SetIndex' is a valid face set index for the results stored in 'this'. |

# See Also
TessellatedShapeBuilderResult Class
Autodesk.Revit.DB Namespace